package variable;

public class Var8 {
    public static void main(String[] args) {
        // 메모리를 작게 사용하면 작은 숫자를 표현할 수 있고
        // 메모리를 많이 사용하면   큰 숫자를 표현할 수 있다.
        // 하지만 최근에는 메모리 용량이 저렴하여 너무 작은 범위의 타입은 사용안한다.

        // 정수(기본 int 사용)
        byte b = 127;                  // -128 ~ 127       (실무 X, 단 파일 전송/복사에서는 사용)
        short s = 32767;               // -32,768 ~ 32,767 (실무 X)
        int i = 2147483647;            // -2,147,483,648 ~ 2,147,483,647 (약 20억)
        long l = 9223372036854775807L; // -9,223,372,036,854,775,808 ~ 9,223,372,036,854,775,807
        
        
        // 실수(기본 double 사용)
        float f = 10.0f;               // float은 표현 범위가 작아서 소수점 계산에서 문제가 자주 발생함 (실무 X)
        double d = 10.0;               // double이 제일 범위가 길다


        /**
         * 자주 쓰는 타입 정리
         * - 정수   : int, long : 기본 int를 사용하고 20억이 넘을 것 같으면 long 사용
         * - 실수   : double
         * - 불린형 : boolean   : 조건문에서 자주 사용
         * - 문자열 : String    : 문자 하나든 문자열이든 모두 String을 사용
         */


        /**
         * 변수명 관례 - 낙타 표기법
         * 변수, 함수, 클래스 등의 이름을 지을 때 많이 사용하는 표기법이다.
         * 이름이 여러 단어로 구성되어 있을 때, 각 단어의 첫 글자가 대문자로 시작하게한다.
         *
         * 클래스만   첫 글자 대문자 + 낙타 표기법이고
         * 나머지들은 첫 글자 소문자 + 낙타 표기법
         *
         * 예외는
         * 상수는 모두 대문자를 사용하고 언더바로 구분한다. ex) USER_LIMIT
         * 패키지는 모두 소문자를 사용한다.              ex) org.spring.boot
         */
        int myAccount;
    }
}
