package loop;

public class For1 {
    public static void main(String[] args) {
        // for문은 특정 반복 횟수가 지정될 때 사용한다.
        // for (초기식; 조건식; 증감식) 구조라서 while문을 조금 더 편하게 다루도록 구조화 한 것

        // for vs while
        // while문과 다르게 한 줄에 구조화가 담겨있어 반복 횟수와 관련된 코드와 나머지 코드를 명확하게 구분할 수 있어
        // for문이 코드 이해가 쉽다.
        // 즉, 반복횟수가 정해진 경우는 for문을 사용하는 것이 구조적으로 더 깔끔하고 유지보수 하기 좋다.

        /**
         * 1. 초기식이 실행된다. 주로 반복 횟수와 관련된 변수를 선언하고 초기화할 때 사용한다. 초기식은 딱 1번만 사용된다.
         * 2. 조건식을 검증한다. 참이면 코드를 실행하고 거짓이면 for문을 빠져나간다.
         * 3. 코드를 실행한다.
         * 4. 코드가 종료되면 증감식을 실행한다. 주로 초기식에 넣은 반복 횟수와 관련된 변수의 값을 증가할 때 사용한다.
         * 5. 다시 2번부터 시작한다.(무한 반복)
         */

        for (int i = 1; i <= 10; i++) {
            System.out.println(i);
        }
    }
}
