package operator;

public class Assign1 {
    /**
     * 실무에서 자주 사용하는 연산자
     * - 산술 연산자 : +, -, *, /, %
     * - 증감 연산자 : ++, --
     * - 논리 연산자 : &&, ||, !
     * - 대입 연산자 : =, +=, -=, *=, /=, %=
     *
     * - 삼항 연산자        : ? :
     * - instanceof 연산자 : 객체 타입을 확인
     * - 그외              : new, [](배열 인덱스), .(객체 멤버 접근), ()(메서드호출)
     *
     *
     * 실무에서 사용안하는 연산자는 비트 연산자이다. (&, |, ^, ~, <<, >>, >>>)
     */

    public static void main(String[] args) {
        int a = 5;
        a += 3;      // 5 + 3  = 8  : a = a + 3
        a -= 2;      // 8 - 2  = 6  : a = a - 2
        a *= 4;      // 6 * 4  = 24 : a = a * 4
        a /= 3;      // 24 / 4 = 8  : a = a * 3
        a %= 5;      // 8 % 5  = 3  : a = a % 5
        System.out.println(a);
    }
}
